########## დავალება1 ######

#squared_numbers= {i**2 for i in range(1, 11)}
#print (squared_numbers)


####### დავალება 2 ######



#მომხმარებელს მოთხოვეთ შეიყვანოს სტრინგის ტიპის მონაცემი, დააბრუნეთ სეტი, 
#რომლის ელემენტებიც არის სტრინგში არსებული თითოეული სიმბოლო

# userinput=input("შეიყვანეთ ტექსტი: ")
# element=set(userinput)
# print(element)



##### დავალება 3 #####
#აღწერეთ ორი tuple ტიპის მონაცემი, გააერთიანეთ ეს ორი tuple და დაბეჭდეთ ერთი მთლიანი დუბლიკატების გარეშე,
#  შექმენით ლისტი duplicated_values და მასში დაამატეთ ის ინფორმაცია მხოლოდ ერთხელ, 
# რომელიც დუბლირებული სახით გვხვდება tuple-ში, დაბეჭდეთ მოცემული სია



# tuple1= (2, 6, 4, "hello", "hi", 7 )
# tuple2= ("john", 2, 8, "hello", 7, "Doe" )
# dublicated= set (tuple1).difference(tuple2)

# # print(set (tuple1 + tuple2))
# print(dublicated)




###### დავალება 4 ########
# აღწერეთ ორი ტაპლის ტიპის მონაცემი, დაბეჭდეთ ტაპლი სადაც პირველ და ბოლო ელემენტს შეცვლილი ექნება ადგილები:


# tuple1= (1, 2, 5, 6, 8, )
# tuple2= (tuple1[-1],) + tuple1[1:-1] + (tuple1[0],)

# print (tuple1)
# print (tuple2)


######### დავალება 5 #########
# აღწერეთ ერთმანეთში ჩადგმული ტაპლის მონაცემები, დაბეჭდეთ ერთი სრული ტაპლი, სადაც მოცემული იქნება ყველა ელემენტი.










########### დავალება 6 #############


# set1 = {1, 2, 3}  
# set2 = {'a', 'b', 'c'}  

# setprnt= {(x, y) for x in set1 for y in set2}

# print(setprnt)